"""Кортежи:"""

"""1. Допустим, у тебя есть две переменные a = 5 и b = 10. Обменяй их значения, используя кортежи."""


# """2. Дан список кортежей, где каждый кортеж содержит имя и возраст,
# например: people = [("John", 35), ("Doe", 25), ("Jane", 30)]. Отсортируй этот список по возрасту"""
#
# people = [("John", 35), ("Doe", 40), ("Jane", 30)]
# people.sort(key=lambda x: x[1], reverse=False)
# print(people)

"""3. Дан кортеж, содержащий повторяющиеся элементы, например: t = (2, 5, 3, 2, 8, 5, 9, 5). 
Подсчитай, сколько раз каждый элемент встречается в кортеже, и выведи эту информацию."""

# t = (2, 5, 3, 2, 8, 5, 9, 5)
# count_2 = t.count(2)
# count_5 = t.count(5)
# print(count_2)
# print(count_5)

"""4. Дан кортеж, например: t = (2, 5, 3, 2, 8, 5, 9, 5). И элемент, например x = 5. 
Найди индекс первого вхождения x или выведи, что элемент не найден."""

# t = (2, 1, 3, 2, 8, 5, 9, 5)
# x = 4
# if x in t:
#     a = t.index(x)
#     print(a)
# else:
#     print("no")



"""5. Даны два кортежа, например: t1 = (1, 2, 3) и t2 = (1, 2, 4). Сравни их. 
Если первый кортеж больше второго, выведи "Первый кортеж больше", 
если меньше - "Второй кортеж больше", и "Кортежи равны", если они равны. 
(потом словами объяснишь почему один больше другого)"""

# t1 = (1, 2, 3, 5)
# t2 = (5, 2, 4)
#
# if t1 > t2:
#     print("Первый кортеж больше")
# if t2 > t1:
#     print("Второй кортеж больше")
# else:
#     print("tuples are equal")

print("Hello Git !!!")


