"""Напиши функцию, которая при её вызове выводит приветствие "Привет, мир!". """

# def my_first_function():
#     greeting = "Hello World !!!"
#     print(greeting)
#
#
# my_first_function()


"""Напиши функцию, которая выводит таблицу умножения для числа 5."""


# def multiplication_table():
#     table = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#     a = 5
#     b = []
#     for i in table:
#         b = i * a
#         print(f"{a} * {i} = {b}")


# multiplication_table()


# def multiplication_table():
#     for i in range(1, 11):
#         result = 5 * i
#         print(f"5 x {i} = {result}")
#
#
# multiplication_table()

"""Создай функцию, которая выводит твой список дел на сегодня. (Например: завтрак, учёба, тренировка, ужин.)"""


# def schedule():
#     my_schedule = {"завтрак" : 7.30, "учёба" : 9.00, "тренировка" : 15.00, "ужин" : 18.00}
#     print(my_schedule)
#
#
# schedule()

"""Напиши функцию, которая выводит количество дней в каждом месяце года (исключая високосные года)."""


# def calendar():
#     days = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
#     month = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь",
#         "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
#
#     for i in range(12):
#         print(f"{month[i]}: {days[i]} дней")
#
#
# calendar()


"""Создай функцию, которая выводит случайное число от 1 до 100. (Подсказка: используй модуль random.)"""


"""Напиши функцию, которая выводит простой треугольник из символов '*' высотой 5 строк."""

"""Напиши функцию, которая выводит буквы алфавита от 'a' до 'z'."""



"""Создай функцию, которая просит пользователя представиться и выводит приветствие типа "Привет, [имя]!"""""

# def zdarovalka():
#
#     input("фамилия, звание, цель задания? :")
#     print("присаживаемся")
#
#
# zdarovalka()

"""Напиши функцию, которая просит пользователя ввести температуру 
в градусах Цельсия и выводит её эквивалент в градусах Фаренгейта."""

# def temperature():



"""Создай функцию, которая просит пользователя ввести 5 оценок (от 1 до 5), 
затем вычисляет и выводит средний балл."""


def table():

    num =  sum(range(1,6))
    midl_value = num / 5
    print(f"среднее арифметическое = {midl_value}")


table()





