"""Напиши функцию, которая принимает два числа в качестве параметров и возвращает их произведение."""

# def multiplication(a,b):
#
#     c = a * b
#     return c
#
# d = multiplication(3,9)
# print(d)           #print(multiplication(4,6))


"""Создай функцию, которая принимает два числа и возвращает большее из них."""

# def more(a,b):
#
#     c = max(a,b)
#     return c
#
# d = more(69,9)
# print(d)


"""Напиши функцию, которая принимает радиус круга в качестве параметра и возвращает его площадь."""

"""Создай функцию, которая преобразует время в часах в минуты."""

# def min(a):
#
#
#     c = a * 60
#     return c
#
# print(min(7))

"""Напиши функцию, которая принимает число n и возвращает список целых чисел от 1 до n."""

# def num(n):
#     a = list(range(1, n+1))
#     return a
#
# b = num(5)
# print(b)



"""Создай функцию, которая принимает число и возвращает True, 
если число чётное, и False, если нечётное."""

# def boolean(a):
#
#     if a % 2 == 0:
#         print(True)
#     else:
#         print(False)
#
# boolean(int(input("number: ")))


"""""""***Напиши функцию, которая принимает список чисел и возвращает их среднее значение."""

# def average(num):
#
#     total = sum(num)
#     average_value = total / len(num)
#     return average_value
#
#
# numbers_list = [1, 2, 3, 4, 5, 6]
# result = average(numbers_list)
# print(result)




"""Напиши функцию, которая принимает две строки и возвращает их объединение (конкатенацию)."""